{
  "title": "Woodstock city, police targeted by 'cyber attack'",
  "image": null,
  "summary": "The City of Woodstock and the Woodstock Police Service are both currently suffering cyber attacks. Woodstock’s top administrator, David Creery, confirmed the city had a network breach early Saturday morning around 4 a.m. when a virus entered its computer syst…",
  "text": "The City of Woodstock and the Woodstock Police Service are both currently suffering cyber attacks.\nWoodstock’s top administrator, David Creery, confirmed the city had a network breach early Saturday morning around 4 a.m. when a virus entered its computer system. That virus has since prevented the city from accessing its email and data networks.\n\nCreery said the city has engaged experts and police in its investigation, including the Woodstock Police Service and the OPP cyber-crimes unit.\n\nThe attack “has the appearance” of aransomware, though no formal ransom demand has been made, Creery added.\n\nRansomware is a type of malicious computer program that denies access to the system or its data until a ransom is paid. If that ransom is paid, the hacker then provides a key or password that unlocks the data.\n\nThe Woodstock Police Service is also experiencing a separate attack that started around 2:30 a.m. Monday morning, Insp. Marci Shelton said, but have not indicated whether it is ransomware.\n\nPolice are continuing operations largely as normal and police response is not impacted, Shelton stressed. The department’s email and internet networks are down, so residents cannot use online reporting tools or Facebook Messenger, but otherwise response and reporting continue as usual. Residents should call the station if they need police or dial 911 in emergencies.\n\nThrough expert examination of the city networks, Creery said there is no indication that any personal or financial information has been compromised. Shelton said there is no indication of personal or financial information being stolen from police either.\n\nThe city is currently in the process of minimizing the impact and resolving the attack, including containing the city’s network and using experts to examine the city’s computers to determine how, when and why the attack occurred. Creery said the city hopes to begin recovery of its systems later Tuesday.\n\nWoodstock police are working with the OPP cyber-crimes unit, as well as its own investigators, IT staff and a third-party company to resolve its cyber attack, Shelton said.\n\nThe City of Stratford experienced a similar attack in April and, last week, officials revealed they had paid a hacker the equivalent of $75,000 in Bitcoin. The attack crippled the city’s computer system, though the city later said there was no evidence of data theft following the attack.\n\nCarmi Levy, a London-based tech analyst, said these kinds of attacks are becoming increasingly common.\n\n“The fact that you have two significant high-profile ransomeware attacks relatively close together … confirms that this is a major issue and it is getting worse,” Levy said.\n\nBut the very last thing cities should do if experiencing a ransomeware attack is pay, Levy added.\n\n“In some cases, the hackers could simply take the money and run. … Even if they do unlock your data and allow you to regain access to what was lost, the fact that you elected to pay makes you more likely to be attacked in future,” Levy said.\n\nPayment amounts to a “feeding frenzy among sharks,” Levy added. Hackers will be more likely to target you in future, and it sets a dangerous precedent for all hackers looking at cities as potential targets.\n\nThough he’s not involved in Woodstock’s response to this attack, Levy said a ransomware victim would typically be restoring backup data, reinstalling operating systems and apps, and rebuilding its infrastructure, essentially from scratch.\n\nIf the city was well-prepared, that would allow the city to come back “like the attack never happened” without paying a ransom – saving the city a lot of money and aggravation, Levy said.\n\nThe city’s email system is currently down, the statement noted, but residents can continue to call city hall and all third-party systems, such as the city’s website and registration for recreation programs, are running as normal.",
  "tags": null
}
